In [1]:
%run py_import.py

**Series**

In [3]:
obj = pd.Series(range(4), index = list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [4]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [11]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [13]:
obj2 = pd.Series([4,np.nan, 7, np.nan, -3, 2])
obj2.sort_values()  # 不论升序降序，Nan值默认都放在末尾

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

**DataFrame**

In [6]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),index = ['three','one'],columns = list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [7]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [9]:
frame.sort_index(axis = 'columns') 
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [10]:
frame.sort_index(axis = 1 ,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [14]:
frame2 = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame2

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [15]:
frame2.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [17]:
obj3 = pd.Series([7,-5,7,4,2,0,4])
print(obj3)
print('\n')
print(obj3.rank())    # 第二列里面是名次，例如：两个7的排名分别是第六名和第七名，所以他俩的平均排名就是（6+7）/2 = 6.5

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64


0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64